In [1]:
## Pandas

In [2]:
import pandas as pd

* Series----1d array
*Data Frame -----2d array(Table format,row & col)

In [3]:
a = pd.Series([])
b = pd.Series([1,2,33,47,58,100])
c = pd.Series((45,89,20,30,44))
d = pd.Series({'a':10,'b':15,'c':56,'d':99})

C:\Users\Ragini\AppData\Local\Temp\ipykernel_8180\1746593775.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  a = pd.Series([])

In [4]:
type(a)
type(b)

pandas.core.series.Series

In [5]:
a

Series([], dtype: float64)

In [6]:
b

0      1
1      2
2     33
3     47
4     58
5    100
dtype: int64

In [7]:
c

0    45
1    89
2    20
3    30
4    44
dtype: int64

In [8]:
d

a    10
b    15
c    56
d    99
dtype: int64

In [9]:
import numpy as np

In [10]:
n = np.array([1,2,3,4,40])

In [11]:
x = pd.Series(n)

In [12]:
x

0     1
1     2
2     3
3     4
4    40
dtype: int32

In [13]:
type(x)

pandas.core.series.Series

In [15]:
b=pd.Series([1,2,[11,10],33,[12,23],47,58,100])

In [16]:
b

0           1
1           2
2    [11, 10]
3          33
4    [12, 23]
5          47
6          58
7         100
dtype: object

In [17]:
b[0]

1

In [18]:
b[2]

[11, 10]

In [20]:
b[3:7]

3          33
4    [12, 23]
5          47
6          58
dtype: object

In [21]:
d

a    10
b    15
c    56
d    99
dtype: int64

In [22]:
d['d']

99

In [23]:
d['b':]

b    15
c    56
d    99
dtype: int64

In [24]:
s = pd.Series([12,52,42,10,23],index=['q','w','e','r','t'])

In [25]:
s

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [27]:
s1 = pd.Series([12,52,42,10,23],index=list('asdfg'))

In [28]:
s1

a    12
s    52
d    42
f    10
g    23
dtype: int64

In [34]:
s1.idxmax()

's'

In [35]:
s1.idxmin()

'f'

In [30]:
s1.value_counts()

12    1
52    1
42    1
10    1
23    1
dtype: int64

In [31]:
s1.argmax()

1

In [32]:
s1.argmin()

3

## DataFrame

In [36]:
a= pd.DataFrame()
b= pd.DataFrame([1,2,55,40,86])

In [37]:
a

Empty DataFrame
Columns: []
Index: []

In [38]:
b

    0
0   1
1   2
2  55
3  40
4  86

In [39]:
type(b)

pandas.core.frame.DataFrame

In [40]:
b

    0
0   1
1   2
2  55
3  40
4  86

In [41]:
c=pd.DataFrame([[1,2,3],[10,20,30],[7,8,9]])

In [42]:
c

    0   1   2
0   1   2   3
1  10  20  30
2   7   8   9

In [45]:
w=pd.DataFrame([[1,2,3,4,5],[10,20,30,40,50],[7,8,9,10,9],[3,4,5,3,6],[7,5,2,5,1]])

In [46]:
w

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  40  50
2   7   8   9  10   9
3   3   4   5   3   6
4   7   5   2   5   1

In [51]:
w.head(1)

   0  1  2  3  4
0  1  2  3  4  5

In [50]:
w.tail(2)

   0  1  2  3  4
3  3  4  5  3  6
4  7  5  2  5  1

In [54]:
w.sample(3)

    0   1   2   3   4
4   7   5   2   5   1
2   7   8   9  10   9
1  10  20  30  40  50

In [55]:
c= pd.DataFrame([[1,2,4,5,6],[34,56,2,4,5],[1,5,np.nan,3,67],[23,np.nan,34,45,56]])

In [56]:
c

    0     1     2   3   4
0   1   2.0   4.0   5   6
1  34  56.0   2.0   4   5
2   1   5.0   NaN   3  67
3  23   NaN  34.0  45  56

In [57]:
c1= pd.DataFrame([[1,2,4,5,6],[34,56,2,'Missing',5],[1,5,np.nan,3,67],[23,np.nan,34,'Missing',56]])

In [58]:
c1

    0     1     2        3   4
0   1   2.0   4.0        5   6
1  34  56.0   2.0  Missing   5
2   1   5.0   NaN        3  67
3  23   NaN  34.0  Missing  56

In [60]:
c1= pd.DataFrame([[1,2,4,5,6],[34,56,2,'Missing',5],[1,5,np.nan,3,67],[23,np.nan,34,'Missing',56]],columns=['colA','colS','colL','colP','colK'])

In [61]:
c1

   colA  colS  colL     colP  colK
0     1   2.0   4.0        5     6
1    34  56.0   2.0  Missing     5
2     1   5.0   NaN        3    67
3    23   NaN  34.0  Missing    56

In [62]:
c1['colL']

0     4.0
1     2.0
2     NaN
3    34.0
Name: colL, dtype: float64

In [66]:
c1[['colA','colS']][1:4]

   colA  colS
1    34  56.0
2     1   5.0
3    23   NaN

In [68]:
c1['colA'].max()

34

In [69]:
c1.shape

(4, 5)

In [70]:
c1['new_col']=[12,23,34,45]

In [71]:
c1

   colA  colS  colL     colP  colK  new_col
0     1   2.0   4.0        5     6       12
1    34  56.0   2.0  Missing     5       23
2     1   5.0   NaN        3    67       34
3    23   NaN  34.0  Missing    56       45

c1['colU']=c1['colA']+c1['colS']

In [73]:
c1

   colA  colS  colL     colP  colK  new_col
0     1   2.0   4.0        5     6       12
1    34  56.0   2.0  Missing     5       23
2     1   5.0   NaN        3    67       34
3    23   NaN  34.0  Missing    56       45

In [74]:
c1['colU']=c1['colA']+c1['colS']

In [75]:
c1

   colA  colS  colL     colP  colK  new_col  colU
0     1   2.0   4.0        5     6       12   3.0
1    34  56.0   2.0  Missing     5       23  90.0
2     1   5.0   NaN        3    67       34   6.0
3    23   NaN  34.0  Missing    56       45   NaN

In [77]:
f=c1['colS']>50

In [79]:
c1[f]

   colA  colS  colL     colP  colK  new_col  colU
1    34  56.0   2.0  Missing     5       23  90.0